<script setup>
import { ref } from "vue";
import { axiosClient } from "@/_helpers/api";
import { onMounted } from "vue";
import { useRouter, useRoute } from "vue-router";
import { useProductStore } from "@/stores/productStore";

const productStore = useProductStore();
const router = useRouter();
const route = useRoute();
onMounted(() => {
  getNewsArticle();
});

async function getData() {
  await axiosClient({
    url: "/map_change/api/v1/get_names",
  }).then((res) => {
    console.log(res);
  });
}
async function postData() {
  var data = {
    id: 1,
    name: "test",
  };
  await axiosClient({
    url: "some/test",
    method: "POST",
    data: data,
  }).then((res) => {
    console.log(res);
  });
}

function getNewsArticle() {
  console.log("r", router.currentRoute._value.params.id);
}
</script>

<template>
  <div class="product">
    <h4>
      🔝 Якутия в ТОП 10 регионов получивших наибольшую сумму софинансирования
      Фонда президентских грантов
    </h4>
    <div class="img__wrapper">
      <img src="https://source.unsplash.com/1600x400/?animal" alt="" />
    </div>
    <p>
      🔹 Фондом президентских грантов подведены итоги конкурса на
      софинансирование региональных конкурсов, направленных на поддержку
      некоммерческих неправительственных организаций. Республика Саха (Якутия)
      по сумме привлечённых средств в разрезе ДФО заняла лидирующие позицию.
      Общая сумма софинансирования регионального конкурса из федерального
      бюджета составит 48 447 426 руб. (Приморский край 37 230 059 рб, Бурятия
      40 390 129рб). В целом по России Якутия замыкает ТОП 10 регионов
      получивших наибольшую сумму софинансирования после Пермской, Челябинской,
      Белогородской областей, Новосибирского, Краснодарского, Красноярского
      края, Республики Башкортостан, Татарстан и Ханты Мансийского автономного
      округа.
    </p>
    <p>
      🔹Общая сумма конкурса грантов Главы РС(Я) на развитие гражданского
      общества в 2023 году с учетом софинансирования составит более 100 млн руб.
      Объявление конкурса планируется в марте.
    </p>
  </div>
</template>

<style scoped></style>
